const initialAnimals = [
  {
    name: "Ворон",
    size: "Крошечный",
    ac: "12",
    initiative: "+2",
    hp: "2",
    speed: "10 фт., полёт 50 фт.",
    stats: {
      str: { value: 2, mod: "-4" },
      dex: { value: 14, mod: "+2" },
      con: { value: 10, mod: "+0" },
      int: { value: 5, mod: "-3" },
      wis: { value: 13, mod: "+1" },
      cha: { value: 6, mod: "-2" }
    },
    senses: "пассивное Восприятие 13",
    languages: "нет",
    cr: "0",
    traits: [
      {
        name: "Подражание звукам",
        desc: "Ворон может имитировать простые услышанные им звуки (шёпот, щебетание). Проверка Мудрости (Проницательность) Сл 10 позволяет распознать подделку."
      }
    ],
    actions: [
      {
        name: "Клюв",
        desc: "Бросок рукопашной атаки: +4, досягаемость 5 фт. Попадание: 1 колющего урона."
      }
    ]
  },
  {
    name: "Кошка",
    size: "Крошечный",
    ac: "12",
    initiative: "+2",
    hp: "2",
    speed: "40 фт., лазание 40 фт.",
    stats: {
      str: { value: 3, mod: "-4" },
      dex: { value: 15, mod: "+2" },
      con: { value: 10, mod: "+0" },
      int: { value: 3, mod: "-4" },
      wis: { value: 12, mod: "+1" },
      cha: { value: 7, mod: "-2" }
    },
    senses: "Тёмное зрение 60 фт., пассивное Восприятие 13",
    languages: "нет",
    cr: "0",
    traits: [
      {
        name: "Прыгучая",
        desc: "Дистанция прыжка кошки определяется её Ловкостью, а не Силой."
      }
    ],
    actions: [
      {
        name: "Царапание",
        desc: "Бросок рукопашной атаки: +4, досягаемость 5 фт. Попадание: 1 рубящего урона."
      }
    ]
  },
  {
    name: "Крыса",
    size: "Крошечный",
    ac: "10",
    initiative: "+0",
    hp: "1",
    speed: "20 фт., лазание 20 фт.",
    stats: {
      str: { value: 2, mod: "-4" },
      dex: { value: 11, mod: "+0" },
      con: { value: 9, mod: "-1" },
      int: { value: 2, mod: "-4" },
      wis: { value: 10, mod: "+0" },
      cha: { value: 4, mod: "-3" }
    },
    senses: "Тёмное зрение 30 фт., пассивное Восприятие 12",
    languages: "нет",
    cr: "0",
    traits: [
      {
        name: "Проворство",
        desc: "Крыса не вызывает Провоцированных атак, когда выходит из вражеской досягаемости."
      }
    ],
    actions: [
      {
        name: "Укус",
        desc: "Бросок рукопашной атаки: +2, досягаемость 5 фт. Попадание: 1 колющего урона."
      }
    ]
  },
  {
    name: "Куница",
    size: "Крошечный",
    ac: "13",
    initiative: "+3",
    hp: "1",
    speed: "30 фт., лазание 30 фт.",
    stats: {
      str: { value: 3, mod: "-4" },
      dex: { value: 16, mod: "+3" },
      con: { value: 8, mod: "-1" },
      int: { value: 2, mod: "-4" },
      wis: { value: 12, mod: "+1" },
      cha: { value: 3, mod: "-4" }
    },
    senses: "Тёмное зрение 60 фт., пассивное Восприятие 13",
    languages: "нет",
    cr: "0",
    actions: [
      {
        name: "Укус",
        desc: "Бросок рукопашной атаки: +5, досягаемость 5 фт. Попадание: 1 колющего урона."
      }
    ]
  },
  {
    name: "Летучая мышь",
    size: "Крошечный",
    ac: "12",
    initiative: "+2",
    hp: "1",
    speed: "5 фт., полёт 30 фт.",
    stats: {
      str: { value: 2, mod: "-4" },
      dex: { value: 15, mod: "+2" },
      con: { value: 8, mod: "-1" },
      int: { value: 2, mod: "-4" },
      wis: { value: 12, mod: "+1" },
      cha: { value: 4, mod: "-3" }
    },
    senses: "Слепое зрение 60 фт., пассивное Восприятие 11",
    languages: "нет",
    cr: "0",
    actions: [
      {
        name: "Укус",
        desc: "Бросок рукопашной атаки: +4, досягаемость 5 фт. Попадание: 1 колющего урона."
      }
    ]
  },
  {
    name: "Лягушка",
    size: "Крошечный",
    ac: "11",
    initiative: "+1",
    hp: "1",
    speed: "20 фт., плавание 20 фт.",
    stats: {
      str: { value: 1, mod: "-5" },
      dex: { value: 13, mod: "+1" },
      con: { value: 8, mod: "-1" },
      int: { value: 1, mod: "-5" },
      wis: { value: 8, mod: "-1" },
      cha: { value: 3, mod: "-4" }
    },
    senses: "Тёмное зрение 30 фт., пассивное Восприятие 11",
    languages: "нет",
    cr: "0",
    traits: [
      {
        name: "Амфибия",
        desc: "Лягушка может дышать как воздухом, так и под водой."
      },
      {
        name: "Прыжок с места",
        desc: "Прыжки в длину до 10 фт. и в высоту до 5 фт. без разбега."
      }
    ],
    actions: [
      {
        name: "Укус",
        desc: "Бросок рукопашной атаки: +3, досягаемость 5 фт. Попадание: 1 колющего урона."
      }
    ]
  },
  {
    name: "Осьминог",
    size: "Маленький",
    ac: "12",
    initiative: "+2",
    hp: "3",
    speed: "5 фт., плавание 30 фт.",
    stats: {
      str: { value: 4, mod: "-3" },
      dex: { value: 15, mod: "+2" },
      con: { value: 11, mod: "+0" },
      int: { value: 3, mod: "-4" },
      wis: { value: 10, mod: "+0" },
      cha: { value: 4, mod: "-3" }
    },
    senses: "Тёмное зрение 30 фт., пассивное Восприятие 12",
    languages: "нет",
    cr: "0",
    traits: [
      {
        name: "Уплотнение",
        desc: "Может проходить через пространство шириной в 1 дюйм без штрафов."
      },
      {
        name: "Подводное дыхание",
        desc: "Может дышать только под водой."
      }
    ],
    actions: [
      {
        name: "Щупальца",
        desc: "Бросок рукопашной атаки: +4, досягаемость 5 фт. Попадание: 1 дробящего урона."
      }
    ],
    reactions: [
      {
        name: "Чернильное облако (1/день)",
        desc: "Если существо заканчивает ход в 5 фт. от осьминога под водой, он выпускает чернила (куб 5 фт., сильное заслонение) и перемещается на свою скорость."
      }
    ]
  },
  {
    name: "Паук",
    size: "Крошечный",
    ac: "12",
    initiative: "+2",
    hp: "1",
    speed: "20 фт., лазание 20 фт.",
    stats: {
      str: { value: 2, mod: "-4" },
      dex: { value: 14, mod: "+2" },
      con: { value: 8, mod: "-1" },
      int: { value: 1, mod: "-5" },
      wis: { value: 10, mod: "+0" },
      cha: { value: 2, mod: "-4" }
    },
    senses: "Тёмное зрение 30 фт., пассивное Восприятие 10",
    languages: "нет",
    cr: "0",
    traits: [
      {
        name: "Паучье лазание",
        desc: "Может лазать по сложным поверхностям и потолкам без проверок."
      },
      {
        name: "Хождение по паутине",
        desc: "Игнорирует ограничения паутины и чувствует вибрации существ в ней."
      }
    ],
    actions: [
      {
        name: "Укус",
        desc: "Бросок рукопашной атаки: +4, досягаемость 5 фт. Попадание: 1 колющего урона + 2 (1к4) урона ядом."
      }
    ]
  },
  {
    name: "Сова",
    size: "Крошечный",
    ac: "11",
    initiative: "+1",
    hp: "1",
    speed: "5 фт., полёт 60 фт.",
    stats: {
      str: { value: 3, mod: "-4" },
      dex: { value: 13, mod: "+1" },
      con: { value: 8, mod: "-1" },
      int: { value: 2, mod: "-4" },
      wis: { value: 12, mod: "+1" },
      cha: { value: 7, mod: "-2" }
    },
    senses: "Тёмное зрение 120 фт., пассивное Восприятие 15",
    languages: "нет",
    cr: "0",
    traits: [
      {
        name: "Облёт",
        desc: "Сова не вызывает Провоцированных атак, когда вылетает из вражеской досягаемости."
      }
    ],
    actions: [
      {
        name: "Когти",
        desc: "Бросок рукопашной атаки: +3, досягаемость 5 фт. Попадание: 1 рубящего урона."
      }
    ]
  },
  {
    name: "Ястреб",
    size: "Крошечный",
    ac: "13",
    initiative: "+3",
    hp: "1",
    speed: "10 фт., полёт 60 фт.",
    stats: {
      str: { value: 5, mod: "-3" },
      dex: { value: 16, mod: "+3" },
      con: { value: 8, mod: "-1" },
      int: { value: 2, mod: "-4" },
      wis: { value: 14, mod: "+2" },
      cha: { value: 6, mod: "-2" }
    },
    senses: "пассивное Восприятие 16",
    languages: "нет",
    cr: "0",
    actions: [
      {
        name: "Когти",
        desc: "Бросок рукопашной атаки: +5, досягаемость 5 фт. Попадание: 1 рубящего урона."
      }
    ]
  },
  {
    name: "Ящерица",
    size: "Крошечный",
    ac: "10",
    initiative: "+0",
    hp: "2",
    speed: "20 фт., лазание 20 фт.",
    stats: {
      str: { value: 2, mod: "-4" },
      dex: { value: 11, mod: "+0" },
      con: { value: 10, mod: "+0" },
      int: { value: 1, mod: "-5" },
      wis: { value: 8, mod: "-1" },
      cha: { value: 3, mod: "-4" }
    },
    senses: "Тёмное зрение 30 фт., пассивное Восприятие 9",
    languages: "нет",
    cr: "0",
    traits: [
      {
        name: "Паучье лазание",
        desc: "Ящерица может лазать по сложным поверхностям, включая потолки, без проверок."
      }
    ],
    actions: [
      {
        name: "Укус",
        desc: "Бросок рукопашной атаки: +2, досягаемость 5 фт. Попадание: 1 колющего урона."
      }
    ]
  },
  {
    name: "Квазит",
    size: "Крошечное",
    ac: "13",
    initiative: "+3",
    hp: "25 (10к4)",
    speed: "40 фт.",
    stats: {
      str: { value: 5, mod: "-3" },
      dex: { value: 17, mod: "+3" },
      con: { value: 10, mod: "+0" },
      int: { value: 7, mod: "-2" },
      wis: { value: 10, mod: "+0" },
      cha: { value: 10, mod: "+0" }
    },
    skills: "Скрытность +5",
    resistances: "Огонь, Холод, Электричество",
    immunities: "Яд, состояние Отравленный",
    senses: "Тёмное зрение 120 футов, пассивное Восприятие 10",
    languages: "Общий, Бездны",
    cr: "1",
    traits: [
      {
        name: "Сопротивление магии",
        desc: "Квазит совершает с Преимуществом спасброски от заклинаний и прочих магических эффектов."
      }
    ],
    actions: [
      {
        name: "Раздирание",
        desc: "Бросок рукопашной атаки: +5, досягаемость 5 фт. Попадание: 5 (1к4 + 3) Рубящего урона, и цель становится Отравленной до начала следующего хода квазита."
      },
      {
        name: "Невидимость",
        desc: "Квазит сотворяет заклинание Невидимость на себя, не нуждаясь в компонентах (заклинательная характеристика — Харизма)."
      },
      {
        name: "Испуг (1/день)",
        desc: "Спасбросок Мудрости: Сл 10, одно существо в 20 футах. Провал: Цель становится Испуганной. Она повторяет этот спасбросок в конце каждого своего хода, оканчивая этот эффект при успехе. Спустя 1 минуту цель автоматически преуспевает."
      },
      {
        name: "Перевоплощение",
        desc: "Квазит либо перевоплощается в летучую мышь (Скорость 10 фт., Полёта 40 фт.), многоножку (Скорость 40 фт., Лазания 40 фт.) или жабу (Скорость 40 фт., Плавания 40 фт.), либо возвращается к своему истинному облику. Его статистика, кроме размера, не меняется в зависимости от формы. Снаряжение, которое он носит или несёт, не трансформируется."
      }
    ]
  }
];